# AngularDimensionRegenFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..AngularDimensionRegenFailed Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Can't form Angular Dimension.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AngularDimensionRegenFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AngularDimensionRegenFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AngularDimensionRegenFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace